# Практические задания ЕГЭ (информатика)
## Сафаров 
### Тип 2
#### №28677

Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). На рисунке приведён частично заполненный фрагмент 
таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
|  ?  |  ?  |  ?  |  ?  |  F  |
|:---:|:---:|:---:|:---:|:-:|
|  1  |  0  |  0  |  1  |  1  |
|  0  |     |     |  1  |  1  |
|     |  1  |  0  |     |  1  |

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы. 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
~~~
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((x <= y) or (y == w)) and ((x or z) == w):
                    print(x, y, z, w)
~~~
Ответ: zyxw.
